In [16]:
import pandas as pd
data = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Height': [5.1, 6.2, 5.1, 5.2],
        'Qualification': ['Msc', 'MA', 'Msc', 'Msc']}
df = pd.DataFrame(data)
df['Grade'] = ['E', 'A', 'S', 'g']
df

     Name  Height Qualification Grade
0     Jai     5.1           Msc     E
1  Princi     6.2            MA     A
2  Gaurav     5.1           Msc     S
3    Anuj     5.2           Msc     g

In [9]:
df['Height']

0    5.1
1    6.2
2    5.1
3    5.2
Name: Height, dtype: float64

In [18]:
df['Height12'] = df.apply(lambda row: (row.Height + 10), axis = 1)
df

     Name  Height Qualification Grade  Height12
0     Jai     5.1           Msc     E      15.1
1  Princi     6.2            MA     A      16.2
2  Gaurav     5.1           Msc     S      15.1
3    Anuj     5.2           Msc     g      15.2

In [21]:
df['Height23'] = df['Height']  + 10
df

     Name  Height Qualification Grade  Height12  Height23
0     Jai     5.1           Msc     E      15.1      15.1
1  Princi     6.2            MA     A      16.2      16.2
2  Gaurav     5.1           Msc     S      15.1      15.1
3    Anuj     5.2           Msc     g      15.2      15.2

In [ ]:
class Date(self):
    def __init__(self, d, m, y):
        self.d = d
        self.m = m
        self.y = y
def leapy(ly):
    if ly % 400 == 0:
        return 1 
    elif ly%100! = 0 and ly%4 == 0:
        return 1
    else:
        return 0
def cd(d1, d2):